l = ['中国:GDP:不变价:当季同比', '中国:制造业PMI', '中国:CPI:当月同比', '中国:PPI:全部工业品:当月同比', '中国:工业增加值:规模以上工业企业:当月同比(1-2月拆分)', '中国:营业收入:规模以上工业企业:累计同比', '中国:固定资产投资完成额:累计同比', '中国:固定资产投资完成额(扣除房地产开发投资):累计同比', '中国:房地产开发投资完成额:累计同比', '中国:70个大中城市:房屋销售价格指数:新建商品住宅:当月同比', '中国:社会消费品零售总额:当月同比(1-2月合并)', '中国:M1:同比', '中国:M2:同比', '中国:社会融资规模存量:同比', '中国:进口金额:当月同比', '中国:出口金额:当月同比', '中国:贷款市场报价利率(LPR):1年', '中国:贷款市场报价利率(LPR):5年', '中债国债到期收益率:10年', '中国:城镇调查失业率']
if __name__ == '__main__':
    x = int(input('Input column id:\n'))
    print(l[x])
    # 8 9 14 3